"""
    2. Представлен список чисел. 
    Необходимо вывести элементы исходного списка, значения которых больше предыдущего элемента.
    Подсказка: элементы, удовлетворяющие условию, оформить в виде списка. 
    Для формирования списка использовать генератор.
    Пример исходного списка: [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55].
    Результат: [12, 44, 4, 10, 78, 123].
"""



a = [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55]
new = [print(j) for j in a[1:] if a[a.index(j)] > a[a.index(j) - 1]]
#-------------------
lst = [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55]
new = [d for i, d in enumerate(lst[1:], 0) if lst[i+1] > lst[i]]
print(new)
#-------------------
new_2 = [print(a[i]) for i in range(1, len(a)) if a[i] > a[i - 1]]


